2017-06-01 08:54:38.172212: I tensorflow/core/distributed_runtime/rpc/grpc_channel.cc:200] Initialize GrpcChannelCache for job ps -> {0 -> 10.42.10.36:2227}
2017-06-01 08:54:38.172255: I tensorflow/core/distributed_runtime/rpc/grpc_channel.cc:200] Initialize GrpcChannelCache for job worker -> {0 -> localhost:2228}
2017-06-01 08:54:38.192050: I tensorflow/core/distributed_runtime/rpc/grpc_channel.cc:200] Initialize GrpcChannelCache for job ps -> {0 -> 10.42.10.36:2227}
2017-06-01 08:54:38.192093: I tensorflow/core/distributed_runtime/rpc/grpc_channel.cc:200] Initialize GrpcChannelCache for job worker -> {0 -> localhost:2228}


2017-06-01 08:54:38.195197: I tensorflow/contrib/verbs/rdma.cc:98] Start RdmaAdapter: mlx5_0
2017-06-01 08:54:38.195240: I tensorflow/contrib/verbs/rdma_mgr.cc:40] rmda_mgr on local worker: /job:worker/replica:0/task:0


2017-06-01 08:54:38.197848: I tensorflow/core/distributed_runtime/rpc/grpc_server_lib.cc:291] Started server with target: grpc://localhost:2228


2017-06-01 08:54:38.203564: I tensorflow/contrib/verbs/rdma_mgr.cc:55] connecting to remote node /job:ps/replica:0/task:0


2017-06-01 08:54:38.350169: I tensorflow/core/common_runtime/session_factory.cc:79] SessionFactory type DIRECT_SESSION does not accept target: grpc://localhost:2228
2017-06-01 08:54:38.350245: I tensorflow/core/common_runtime/session_factory.cc:75] SessionFactory type GRPC_SESSION accepts target: grpc://localhost:2228
2017-06-01 08:54:38.360908: I tensorflow/core/distributed_runtime/master_session.cc:984] Session 6e75a111505480ba #local 1 #remote 1
2017-06-01 08:54:38.362772: I tensorflow/core/distributed_runtime/master_session.cc:998] Start master session 6e75a111505480ba with config: 

2017-06-01 08:54:38.365034: I tensorflow/core/common_runtime/simple_graph_execution_state.cc:281] Mapping _SOURCE to 0
2017-06-01 08:54:38.368297: I tensorflow/core/common_runtime/simple_graph_execution_state.cc:281] Mapping init to 126
2017-06-01 08:54:38.368449: I tensorflow/core/graph/costmodel.cc:461] Node 2: init_all_tables type_string: NoOp
2017-06-01 08:54:38.371684: I tensorflow/core/graph/costmodel.cc:461] Node 126: init type_string: NoOp
2017-06-01 08:54:38.371736: I tensorflow/core/common_runtime/optimization_registry.cc:37] Running optimization phase 0
2017-06-01 08:54:38.372736: I tensorflow/core/common_runtime/simple_graph_execution_state.cc:212] Saving {name:'biase' id:40 op device:{/job:ps/replica:0/task:0/cpu:0} def:{biase = VariableV2[_class=["loc:@biase"], container="", dtype=DT_FLOAT, shape=[1], shared_name="", _device="/job:ps/task:0"]()}}
2017-06-01 08:54:38.372785: I tensorflow/core/common_runtime/simple_graph_execution_state.cc:212] Saving {name:'biase/Initializer/random_normal/RandomStandardNormal' id:47 op device:{/job:ps/replica:0/task:0/cpu:0} def:{biase/Initializer/random_normal/RandomStandardNormal = RandomStandardNormal[T=DT_INT32, _class=["loc:@biase"], dtype=DT_FLOAT, seed=0, seed2=0](biase/Initializer/random_normal/shape)}}
2017-06-01 08:54:38.372817: I tensorflow/core/common_runtime/simple_graph_execution_state.cc:212] Saving {name:'weight' id:51 op device:{/job:ps/replica:0/task:0/cpu:0} def:{weight = VariableV2[_class=["loc:@weight"], container="", dtype=DT_FLOAT, shape=[1], shared_name="", _device="/job:ps/task:0"]()}}
2017-06-01 08:54:38.372857: I tensorflow/core/common_runtime/simple_graph_execution_state.cc:212] Saving {name:'weight/Initializer/random_normal/RandomStandardNormal' id:58 op device:{/job:ps/replica:0/task:0/cpu:0} def:{weight/Initializer/random_normal/RandomStandardNormal = RandomStandardNormal[T=DT_INT32, _class=["loc:@weight"], dtype=DT_FLOAT, seed=0, seed2=0](weight/Initializer/random_normal/shape)}}
2017-06-01 08:54:38.372887: I tensorflow/core/common_runtime/simple_graph_execution_state.cc:212] Saving {name:'global_step' id:110 op device:{/job:ps/replica:0/task:0/cpu:0} def:{global_step = VariableV2[container="", dtype=DT_INT32, shape=[], shared_name="", _device="/job:ps/task:0"]()}}
2017-06-01 08:54:38.374446: I tensorflow/core/distributed_runtime/master_session.cc:1333] DoRunWithLocalExecution req: session_handle: "6e75a111505480ba"
feed {
  name: "save/Const:0"
  tensor {
    dtype: DT_STRING
    tensor_shape {
    }
    tensor_content: "\035./checkpoint/model.ckpt-17087"
  }
}
target: "save/restore_all"
options {
}

2017-06-01 08:54:38.374503: I tensorflow/core/distributed_runtime/master_session.cc:1084] Unseen hash 12410759138734202000 for  FdE: save/Const:0
 TN: save/restore_all

 is_partial = 0

2017-06-01 08:54:38.374533: I tensorflow/core/common_runtime/simple_graph_execution_state.cc:326] BuildGraph
2017-06-01 08:54:38.375719: I tensorflow/core/common_runtime/optimization_registry.cc:37] Running optimization phase 0
2017-06-01 08:54:38.375893: I tensorflow/core/distributed_runtime/master_session.cc:71] Created ReffedClientGraph for node with 19
2017-06-01 08:54:38.375922: I tensorflow/core/distributed_runtime/master_session.cc:1094] Preparing to execute new graph
2017-06-01 08:54:38.376344: I tensorflow/core/graph/graph_partition.cc:1047] Added send/recv: controls=0, data=1
2017-06-01 08:54:38.376525: I tensorflow/core/distributed_runtime/master_session.cc:427] Register node {
  name: "_recv_save/Const_0_S0   op: "_Send"
  input: "_recv_save/Const_0"
  device: "/job:worker/replica:0/task:0/cpu:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "client_terminated"
    value {
      b: false
    }
  }
  attr {
    key: "recv_device"
    value {
      s: "/job:ps/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device"
    value {
      s: "/job:worker/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device_incarnation"
    value {
      i: 6916031373759480796
    }
  }
  attr {
    key: "tensor_name"
    value {
      s: "edge_31__recv_save/Const_0"
    }
  }
}
node {
  name: "_recv_save/Const_0"
  op: "_Recv"
  device: "/job:worker/replica:0/task:0/cpu:0"
  attr {
    key: "client_terminated"
    value {
      b: true
    }
  }
  attr {
    key: "recv_device"
    value {
      s: "/job:worker/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device"
    value {
      s: "/job:worker/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device_incarnation"
    value {
      i: 6916031373759480796
    }
  }
  attr {
    key: "tensor_name"
    value {
      s: "save/Const:0"
    }
  }
  attr {
    key: "tensor_type"
    value {
      type: DT_STRING
    }
  }
}
library {
}
versions {
  producer: 22
}

2017-06-01 08:54:38.376812: I tensorflow/core/graph/graph_partition.cc:1047] Added send/recv: controls=0, data=0
2017-06-01 08:54:38.376959: I tensorflow/core/common_runtime/function.cc:458] Graph Initial #nodes 4 #edges 4
2017-06-01 08:54:38.378212: I tensorflow/core/common_runtime/executor.cc:762] node _recv_save/Const_0 is the source of an RPC out
2017-06-01 08:54:38.378540: I tensorflow/core/distributed_runtime/master_session.cc:427] Register node {
  name: "save/RestoreV2_2/shape_and_slices"
  op: "Const"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 1
          }
        }
        string_val: ""
      }
    }
  }
}
node {
  name: "save/RestoreV2_2/tensor_names"
  op: "Const"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 1
          }
        }
        string_val: "weight"
      }
    }
  }
}
node {
  name: "save/RestoreV2_1/shape_and_slices"
  op: "Const"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 1
          }
        }
        string_val: ""
      }
    }
  }
}
node {
  name: "save/RestoreV2_1/tensor_names"
  op: "Const"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 1
          }
        }
        string_val: "global_step"
      }
    }
  }
}
node {
  name: "save/RestoreV2/shape_and_slices"
  op: "Const"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 1
          }
        }
        string_val: ""
      }
    }
  }
}
node {
  name: "save/RestoreV2/tensor_names"
  op: "Const"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 1
          }
        }
        string_val: "biase"
      }
    }
  }
}
node {
  name: "save/RestoreV2_2"
  op: "RestoreV2"
  input: "_recv_save/Const_0_S1"
  input: "save/RestoreV2_2/tensor_names"
  input: "save/RestoreV2_2/shape_and_slices"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
}
node {
  name: "_recv_save/Const_0_S1"
  op: "_Recv"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "client_terminated"
    value {
      b: false
    }
  }
  attr {
    key: "recv_device"
    value {
      s: "/job:ps/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device"
    value {
      s: "/job:worker/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device_incarnation"
    value {
      i: 6916031373759480796
    }
  }
  attr {
    key: "tensor_name"
    value {
      s: "edge_31__recv_save/Const_0"
    }
  }
  attr {
    key: "tensor_type"
    value {
      type: DT_STRING
    }
  }
}
node {
  name: "save/RestoreV2_1"
  op: "RestoreV2"
  input: "_recv_save/Const_0_S1"
  input: "save/RestoreV2_1/tensor_names"
  input: "save/RestoreV2_1/shape_and_slices"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "dtypes"
    value {
      list {
        type: DT_INT32
      }
    }
  }
}
node {
  name: "save/RestoreV2"
  op: "RestoreV2"
  input: "_recv_save/Const_0_S1"
  input: "save/RestoreV2/tensor_names"
  input: "save/RestoreV2/shape_and_slices"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
}
node {
  name: "biase"
  op: "VariableV2"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@biase"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "save/Assign"
  op: "Assign"
  input: "biase"
  input: "save/RestoreV2"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@biase"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "weight"
  op: "VariableV2"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weight"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "save/Assign_2"
  op: "Assign"
  input: "weight"
  input: "save/RestoreV2_2"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "save/Assign_1"
  op: "Assign"
  input: "global_step"
  input: "save/RestoreV2_1"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "save/restore_all"
  op: "NoOp"
  input: "^save/Assign"
  input: "^save/Assign_1"
  input: "^save/Assign_2"
  device: "/job:ps/replica:0/task:0/cpu:0"
}
library {
}
versions {
  producer: 22
}

2017-06-01 08:54:38.412405: I tensorflow/core/distributed_runtime/master_session.cc:505] RunPartitions step_id 91073656284670670 execution_count 0





2017-06-01 08:54:38.412492: I tensorflow/core/distributed_runtime/base_rendezvous_mgr.cc:156] BaseRemoteRendezvous Send 0x7f78fc0927e0 /job:worker/replica:0/task:0/cpu:0;5ffaade4486403dc;/job:worker/replica:0/task:0/cpu:0;save/Const:0;0:0

2017-06-01 08:54:38.412516: I tensorflow/core/framework/rendezvous.cc:158] Send 0x7f78fc089b80 16570524555477022943 /job:worker/replica:0/task:0/cpu:0;5ffaade4486403dc;/job:worker/replica:0/task:0/cpu:0;save/Const:0;0:0





2017-06-01 08:54:38.412664: I tensorflow/core/common_runtime/executor.cc:1556] Process node: 0 step 2 _SOURCE = NoOp[]() is dead: 0
2017-06-01 08:54:38.412764: I tensorflow/core/common_runtime/executor.cc:1556] Process node: 2 step 2 _recv_save/Const_0 = _Recv[client_terminated=true, recv_device="/job:worker/replica:0/task:0/cpu:0", send_device="/job:worker/replica:0/task:0/cpu:0", send_device_incarnation=6916031373759480796, tensor_name="save/Const:0", tensor_type=DT_STRING, _device="/job:worker/replica:0/task:0/cpu:0"]() is dead: 0





2017-06-01 08:54:38.412800: I tensorflow/core/kernels/sendrecv_ops.cc:112] Recv /job:worker/replica:0/task:0/cpu:0;5ffaade4486403dc;/job:worker/replica:0/task:0/cpu:0;save/Const:0;0:0
2017-06-01 08:54:38.412833: I tensorflow/core/distributed_runtime/base_rendezvous_mgr.cc:246] RemoteRendezvous Recv 0x7f78fc0927e0 /job:worker/replica:0/task:0/cpu:0;5ffaade4486403dc;/job:worker/replica:0/task:0/cpu:0;save/Const:0;0:0
2017-06-01 08:54:38.412872: I tensorflow/core/framework/rendezvous.cc:226] Recv 0x7f78fc089b80 16570524555477022943 /job:worker/replica:0/task:0/cpu:0;5ffaade4486403dc;/job:worker/replica:0/task:0/cpu:0;save/Const:0;0:0





2017-06-01 08:54:38.412918: I tensorflow/core/common_runtime/executor.cc:1611] 0x7f78fc091e20 Async kernel done: _recv_save/Const_0 = _Recv[client_terminated=true, recv_device="/job:worker/replica:0/task:0/cpu:0", send_device="/job:worker/replica:0/task:0/cpu:0", send_device_incarnation=6916031373759480796, tensor_name="save/Const:0", tensor_type=DT_STRING, _device="/job:worker/replica:0/task:0/cpu:0"]()




2017-06-01 08:54:38.413077: I tensorflow/core/common_runtime/executor.cc:1556] Process node: 3 step 2 _recv_save/Const_0_S0 = _Send[T=DT_STRING, client_terminated=false, recv_device="/job:ps/replica:0/task:0/cpu:0", send_device="/job:worker/replica:0/task:0/cpu:0", send_device_incarnation=6916031373759480796, tensor_name="edge_31__recv_save/Const_0", _device="/job:worker/replica:0/task:0/cpu:0"](_recv_save/Const_0) is dead: 0


2017-06-01 08:54:38.413116: I tensorflow/core/kernels/sendrecv_ops.cc:63] Send /job:worker/replica:0/task:0/cpu:0;5ffaade4486403dc;/job:ps/replica:0/task:0/cpu:0;edge_31__recv_save/Const_0;0:0
2017-06-01 08:54:38.413145: I tensorflow/core/distributed_runtime/base_rendezvous_mgr.cc:156] BaseRemoteRendezvous Send 0x7f78fc0927e0 /job:worker/replica:0/task:0/cpu:0;5ffaade4486403dc;/job:ps/replica:0/task:0/cpu:0;edge_31__recv_save/Const_0;0:0
2017-06-01 08:54:38.413183: I tensorflow/core/framework/rendezvous.cc:158] Send 0x7f78fc089b80 14584567498696784511 /job:worker/replica:0/task:0/cpu:0;5ffaade4486403dc;/job:ps/replica:0/task:0/cpu:0;edge_31__recv_save/Const_0;0:0




2017-06-01 08:54:38.413222: I tensorflow/core/common_runtime/executor.cc:2344] Delete frame 



2017-06-01 08:54:38.413549: I tensorflow/contrib/verbs/rdma.cc:144] recv RDMA message: RDMA_MESSAGE_TENSOR_REQUEST
2017-06-01 08:54:38.413659: I tensorflow/contrib/verbs/rdma.cc:227] sent RDMA message: RDMA_MESSAGE_ACK


2017-06-01 08:54:38.413678: I tensorflow/contrib/verbs/rdma.cc:668] try to send tensor: /job:worker/replica:0/task:0/cpu:0;5ffaade4486403dc;/job:ps/replica:0/task:0/cpu:0;edge_31__recv_save/Const_0;0:0;91073656284670670

2017-06-01 08:54:38.413774: I tensorflow/core/framework/rendezvous.cc:226] Recv 0x7f78fc089b80 14584567498696784511 /job:worker/replica:0/task:0/cpu:0;5ffaade4486403dc;/job:ps/replica:0/task:0/cpu:0;edge_31__recv_save/Const_0;0:0


2017-06-01 08:54:38.413925: I tensorflow/contrib/verbs/rdma.cc:227] sent RDMA message: RDMA_MESSAGE_BUFFER_REQUEST
2017-06-01 08:54:38.413989: I tensorflow/contrib/verbs/rdma.cc:144] recv RDMA message: RDMA_MESSAGE_ACK
2017-06-01 08:54:38.414085: I tensorflow/contrib/verbs/rdma.cc:144] recv RDMA message: RDMA_MESSAGE_BUFFER_RESPONSE
2017-06-01 08:54:38.414148: I tensorflow/contrib/verbs/rdma.cc:227] sent RDMA message: RDMA_MESSAGE_ACK



2017-06-01 08:54:38.414165: I tensorflow/contrib/verbs/rdma.cc:668] try to send tensor: /job:worker/replica:0/task:0/cpu:0;5ffaade4486403dc;/job:ps/replica:0/task:0/cpu:0;edge_31__recv_save/Const_0;0:0;91073656284670670

2017-06-01 08:54:38.414230: I tensorflow/core/framework/rendezvous.cc:226] Recv 0x7f78fc089b80 14584567498696784511 /job:worker/replica:0/task:0/cpu:0;5ffaade4486403dc;/job:ps/replica:0/task:0/cpu:0;edge_31__recv_save/Const_0;0:0


2017-06-01 08:54:38.414297: I tensorflow/contrib/verbs/rdma.cc:227] sent RDMA message: RDMA_MESSAGE_TENSOR_WRITE
2017-06-01 08:54:38.414447: I tensorflow/contrib/verbs/rdma.cc:144] recv RDMA message: RDMA_MESSAGE_BUFFER_IDLE
2017-06-01 08:54:38.414503: I tensorflow/contrib/verbs/rdma.cc:227] sent RDMA message: RDMA_MESSAGE_ACK


2017-06-01 08:54:38.454346: I tensorflow/core/distributed_runtime/master_session.cc:1333] DoRunWithLocalExecution req: session_handle: "6e75a111505480ba"
target: "group_deps"
options {
}

2017-06-01 08:54:38.454414: I tensorflow/core/distributed_runtime/master_session.cc:1084] Unseen hash 12426348245450050559 for 
 TN: group_deps

 is_partial = 0

2017-06-01 08:54:38.454433: I tensorflow/core/common_runtime/simple_graph_execution_state.cc:326] BuildGraph
2017-06-01 08:54:38.454820: I tensorflow/core/graph/algorithm.cc:119] Reverse reach init: group_deps
2017-06-01 08:54:38.454848: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : group_deps from init_1
2017-06-01 08:54:38.454860: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : group_deps from init_all_tables
2017-06-01 08:54:38.454870: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : init_1 from _SOURCE
2017-06-01 08:54:38.454992: I tensorflow/core/common_runtime/optimization_registry.cc:37] Running optimization phase 0
2017-06-01 08:54:38.455061: I tensorflow/core/distributed_runtime/master_session.cc:71] Created ReffedClientGraph for node with 5
2017-06-01 08:54:38.455078: I tensorflow/core/distributed_runtime/master_session.cc:1094] Preparing to execute new graph
2017-06-01 08:54:38.455153: I tensorflow/core/graph/graph_partition.cc:1047] Added send/recv: controls=0, data=0
2017-06-01 08:54:38.455228: I tensorflow/core/distributed_runtime/master_session.cc:427] Register node {
  name: "init_all_tables"
  op: "NoOp"
  device: "/job:ps/replica:0/task:0/cpu:0"
}
node {
  name: "init_1"
  op: "NoOp"
  device: "/job:ps/replica:0/task:0/cpu:0"
}
node {
  name: "group_deps"
  op: "NoOp"
  input: "^init_1"
  input: "^init_all_tables"
  device: "/job:ps/replica:0/task:0/cpu:0"
}
library {
}
versions {
  producer: 22
}

2017-06-01 08:54:38.458343: I tensorflow/core/distributed_runtime/master_session.cc:505] RunPartitions step_id 116678187522099002 execution_count 0
2017-06-01 08:54:38.459193: I tensorflow/core/distributed_runtime/master_session.cc:1333] DoRunWithLocalExecution req: session_handle: "6e75a111505480ba"
fetch: "report_uninitialized_variables/boolean_mask/Gather:0"
options {
}

2017-06-01 08:54:38.459228: I tensorflow/core/distributed_runtime/master_session.cc:1084] Unseen hash 3225986229956465460 for 

 FeE: report_uninitialized_variables/boolean_mask/Gather:0
 is_partial = 0

2017-06-01 08:54:38.459242: I tensorflow/core/common_runtime/simple_graph_execution_state.cc:326] BuildGraph
2017-06-01 08:54:38.459515: I tensorflow/core/graph/subgraph.cc:197] Found fetch node for report_uninitialized_variables/boolean_mask/Gather:0
2017-06-01 08:54:38.459650: I tensorflow/core/graph/subgraph.cc:228] Created fetch node: _send_report_uninitialized_variables/boolean_mask/Gather_0 = _Send[T=DT_STRING, client_terminated=true, recv_device="/job:worker/replica:0/task:0/cpu:0", send_device="/job:worker/replica:0/task:0/cpu:0", send_device_incarnation=6916031373759480796, tensor_name="report_uninitialized_variables/boolean_mask/Gather:0"](report_uninitialized_variables/boolean_mask/Gather)
2017-06-01 08:54:38.459686: I tensorflow/core/graph/algorithm.cc:119] Reverse reach init: _send_report_uninitialized_variables/boolean_mask/Gather_0
2017-06-01 08:54:38.459710: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : _send_report_uninitialized_variables/boolean_mask/Gather_0 from report_uninitialized_variables/boolean_mask/Gather
2017-06-01 08:54:38.459722: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/boolean_mask/Gather from report_uninitialized_variables/boolean_mask/Reshape
2017-06-01 08:54:38.459732: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/boolean_mask/Gather from report_uninitialized_variables/boolean_mask/Squeeze
2017-06-01 08:54:38.459743: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/boolean_mask/Reshape from report_uninitialized_variables/Const
2017-06-01 08:54:38.459753: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/boolean_mask/Reshape from report_uninitialized_variables/boolean_mask/concat
2017-06-01 08:54:38.459766: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/boolean_mask/Squeeze from report_uninitialized_variables/boolean_mask/Where
2017-06-01 08:54:38.459783: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/Const from _SOURCE
2017-06-01 08:54:38.459795: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/boolean_mask/concat from report_uninitialized_variables/boolean_mask/concat/values_0
2017-06-01 08:54:38.459807: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/boolean_mask/concat from report_uninitialized_variables/boolean_mask/strided_slice_1
2017-06-01 08:54:38.459822: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/boolean_mask/concat from report_uninitialized_variables/boolean_mask/concat/axis
2017-06-01 08:54:38.459841: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/boolean_mask/Where from report_uninitialized_variables/boolean_mask/Reshape_1
2017-06-01 08:54:38.459858: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/boolean_mask/concat/values_0 from report_uninitialized_variables/boolean_mask/Prod
2017-06-01 08:54:38.459869: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/boolean_mask/strided_slice_1 from report_uninitialized_variables/boolean_mask/Shape_1
2017-06-01 08:54:38.459881: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/boolean_mask/strided_slice_1 from report_uninitialized_variables/boolean_mask/strided_slice_1/stack
2017-06-01 08:54:38.459896: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/boolean_mask/strided_slice_1 from report_uninitialized_variables/boolean_mask/strided_slice_1/stack_1
2017-06-01 08:54:38.459922: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/boolean_mask/strided_slice_1 from report_uninitialized_variables/boolean_mask/strided_slice_1/stack_2
2017-06-01 08:54:38.459935: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/boolean_mask/Reshape_1 from report_uninitialized_variables/LogicalNot
2017-06-01 08:54:38.459947: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/boolean_mask/Reshape_1 from report_uninitialized_variables/boolean_mask/Reshape_1/shape
2017-06-01 08:54:38.459957: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/boolean_mask/Prod from report_uninitialized_variables/boolean_mask/strided_slice
2017-06-01 08:54:38.459970: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/boolean_mask/Prod from report_uninitialized_variables/boolean_mask/Prod/reduction_indices
2017-06-01 08:54:38.459986: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/LogicalNot from report_uninitialized_variables/stack
2017-06-01 08:54:38.460008: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/boolean_mask/strided_slice from report_uninitialized_variables/boolean_mask/Shape
2017-06-01 08:54:38.460029: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/boolean_mask/strided_slice from report_uninitialized_variables/boolean_mask/strided_slice/stack
2017-06-01 08:54:38.460040: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/boolean_mask/strided_slice from report_uninitialized_variables/boolean_mask/strided_slice/stack_1
2017-06-01 08:54:38.460050: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/boolean_mask/strided_slice from report_uninitialized_variables/boolean_mask/strided_slice/stack_2
2017-06-01 08:54:38.460061: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/stack from report_uninitialized_variables/IsVariableInitialized
2017-06-01 08:54:38.460071: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/stack from report_uninitialized_variables/IsVariableInitialized_1
2017-06-01 08:54:38.460082: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/stack from report_uninitialized_variables/IsVariableInitialized_2
2017-06-01 08:54:38.460094: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/IsVariableInitialized from global_step
2017-06-01 08:54:38.460108: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/IsVariableInitialized_1 from weight
2017-06-01 08:54:38.460118: I tensorflow/core/graph/algorithm.cc:128] Reverse reach : report_uninitialized_variables/IsVariableInitialized_2 from biase
2017-06-01 08:54:38.460224: I tensorflow/core/common_runtime/optimization_registry.cc:37] Running optimization phase 0
2017-06-01 08:54:38.460352: I tensorflow/core/distributed_runtime/master_session.cc:71] Created ReffedClientGraph for node with 33
2017-06-01 08:54:38.460377: I tensorflow/core/distributed_runtime/master_session.cc:1094] Preparing to execute new graph
2017-06-01 08:54:38.460832: I tensorflow/core/graph/graph_partition.cc:1047] Added send/recv: controls=0, data=1
2017-06-01 08:54:38.460951: I tensorflow/core/distributed_runtime/master_session.cc:427] Register node {
  name: "_send_report_uninitialized_variables/boolean_mask/Gather_0"
  op: "_Send"
  input: "report_uninitialized_variables/boolean_mask/Gather_S3"
  device: "/job:worker/replica:0/task:0/cpu:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "client_terminated"
    value {
      b: true
    }
  }
  attr {
    key: "recv_device"
    value {
      s: "/job:worker/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device"
    value {
      s: "/job:worker/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device_incarnation"
    value {
      i: 6916031373759480796
    }
  }
  attr {
    key: "tensor_name"
    value {
      s: "report_uninitialized_variables/boolean_mask/Gather:0"
    }
  }
}
node {
  name: "report_uninitialized_variables/boolean_mask/Gather_S3"
  op: "_Recv"
  device: "/job:worker/replica:0/task:0/cpu:0"
  attr {
    key: "client_terminated"
    value {
      b: false
    }
  }
  attr {
    key: "recv_device"
    value {
      s: "/job:worker/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device"
    value {
      s: "/job:ps/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device_incarnation"
    value {
      i: -4670719944347064416
    }
  }
  attr {
    key: "tensor_name"
    value {
      s: "edge_48_report_uninitialized_variables/boolean_mask/Gather"
    }
  }
  attr {
    key: "tensor_type"
    value {
      type: DT_STRING
    }
  }
}
library {
}
versions {
  producer: 22
}

2017-06-01 08:54:38.461156: I tensorflow/core/graph/graph_partition.cc:1047] Added send/recv: controls=0, data=0
2017-06-01 08:54:38.461265: I tensorflow/core/common_runtime/function.cc:458] Graph Initial #nodes 4 #edges 4
2017-06-01 08:54:38.461351: I tensorflow/core/common_runtime/function.cc:462] || 
2017-06-01 08:54:38.461372: I tensorflow/core/common_runtime/function.cc:462] || () -> () {
2017-06-01 08:54:38.461383: I tensorflow/core/common_runtime/function.cc:462] ||   n2 = _Recv[client_terminated=false, recv_device="/job:worker/replica:0/task:0/cpu:0", send_device="/job:ps/replica:0/task:0/cpu:0", send_device_incarnation=-4670719944347064416, tensor_name="edge_48_report_uninitialized_variables/boolean_mask/Gather", tensor_type=string]()
2017-06-01 08:54:38.461393: I tensorflow/core/common_runtime/function.cc:462] ||   n3 = _Send[T=string, client_terminated=true, recv_device="/job:worker/replica:0/task:0/cpu:0", send_device="/job:worker/replica:0/task:0/cpu:0", send_device_incarnation=6916031373759480796, tensor_name="report_uninitialized_variables/boolean_mask/Gather:0"](n2)
2017-06-01 08:54:38.461411: I tensorflow/core/common_runtime/function.cc:462] || }
2017-06-01 08:54:38.461428: I tensorflow/core/common_runtime/function.cc:462] || 
2017-06-01 08:54:38.461446: I tensorflow/core/common_runtime/function.cc:717] Removing list array converter
2017-06-01 08:54:38.461465: I tensorflow/core/common_runtime/function.cc:458] Graph Before #nodes 4 #edges 4
2017-06-01 08:54:38.461517: I tensorflow/core/common_runtime/function.cc:462] || 
2017-06-01 08:54:38.461532: I tensorflow/core/common_runtime/function.cc:462] || () -> () {
2017-06-01 08:54:38.461541: I tensorflow/core/common_runtime/function.cc:462] ||   n2 = _Recv[client_terminated=false, recv_device="/job:worker/replica:0/task:0/cpu:0", send_device="/job:ps/replica:0/task:0/cpu:0", send_device_incarnation=-4670719944347064416, tensor_name="edge_48_report_uninitialized_variables/boolean_mask/Gather", tensor_type=string]()
2017-06-01 08:54:38.461552: I tensorflow/core/common_runtime/function.cc:462] ||   n3 = _Send[T=string, client_terminated=true, recv_device="/job:worker/replica:0/task:0/cpu:0", send_device="/job:worker/replica:0/task:0/cpu:0", send_device_incarnation=6916031373759480796, tensor_name="report_uninitialized_variables/boolean_mask/Gather:0"](n2)
2017-06-01 08:54:38.461563: I tensorflow/core/common_runtime/function.cc:462] || }
2017-06-01 08:54:38.461573: I tensorflow/core/common_runtime/function.cc:462] || 
2017-06-01 08:54:38.461587: I tensorflow/core/common_runtime/constant_folding.cc:280] No constant foldable nodes found
2017-06-01 08:54:38.461647: I tensorflow/core/common_runtime/function.cc:458] Graph ReCopy #nodes 4 #edges 5
2017-06-01 08:54:38.461721: I tensorflow/core/common_runtime/function.cc:462] || 
2017-06-01 08:54:38.461741: I tensorflow/core/common_runtime/function.cc:462] || () -> () {
2017-06-01 08:54:38.461751: I tensorflow/core/common_runtime/function.cc:462] ||   n2 = _Recv[client_terminated=false, recv_device="/job:worker/replica:0/task:0/cpu:0", send_device="/job:ps/replica:0/task:0/cpu:0", send_device_incarnation=-4670719944347064416, tensor_name="edge_48_report_uninitialized_variables/boolean_mask/Gather", tensor_type=string]()
2017-06-01 08:54:38.461762: I tensorflow/core/common_runtime/function.cc:462] ||   n3 = _Send[T=string, client_terminated=true, recv_device="/job:worker/replica:0/task:0/cpu:0", send_device="/job:worker/replica:0/task:0/cpu:0", send_device_incarnation=6916031373759480796, tensor_name="report_uninitialized_variables/boolean_mask/Gather:0"](n2)
2017-06-01 08:54:38.461772: I tensorflow/core/common_runtime/function.cc:462] || }
2017-06-01 08:54:38.461781: I tensorflow/core/common_runtime/function.cc:462] || 
2017-06-01 08:54:38.461810: I tensorflow/core/framework/op_kernel.cc:1034] Instantiating kernel for node: _SOURCE = NoOp[]()
2017-06-01 08:54:38.461865: I tensorflow/core/framework/op_kernel.cc:1034] Instantiating kernel for node: _SINK = NoOp[]()
2017-06-01 08:54:38.461903: I tensorflow/core/framework/op_kernel.cc:1034] Instantiating kernel for node: report_uninitialized_variables/boolean_mask/Gather_S3 = _Recv[client_terminated=false, recv_device="/job:worker/replica:0/task:0/cpu:0", send_device="/job:ps/replica:0/task:0/cpu:0", send_device_incarnation=-4670719944347064416, tensor_name="edge_48_report_uninitialized_variables/boolean_mask/Gather", tensor_type=DT_STRING, _device="/job:worker/replica:0/task:0/cpu:0"]()
2017-06-01 08:54:38.461952: I tensorflow/core/framework/op_kernel.cc:1034] Instantiating kernel for node: _send_report_uninitialized_variables/boolean_mask/Gather_0 = _Send[T=DT_STRING, client_terminated=true, recv_device="/job:worker/replica:0/task:0/cpu:0", send_device="/job:worker/replica:0/task:0/cpu:0", send_device_incarnation=6916031373759480796, tensor_name="report_uninitialized_variables/boolean_mask/Gather:0", _device="/job:worker/replica:0/task:0/cpu:0"](report_uninitialized_variables/boolean_mask/Gather_S3)
2017-06-01 08:54:38.462008: I tensorflow/core/common_runtime/executor.cc:737] node report_uninitialized_variables/boolean_mask/Gather_S3 is the sink of an RPC in
2017-06-01 08:54:38.462038: I tensorflow/core/common_runtime/executor.cc:772] default alloc case local type CPU remote type CPU
2017-06-01 08:54:38.462377: I tensorflow/core/distributed_runtime/master_session.cc:427] Register node {
  name: "report_uninitialized_variables/boolean_mask/Reshape_1/shape"
  op: "Const"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "report_uninitialized_variables/boolean_mask/concat/axis"
  op: "Const"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "report_uninitialized_variables/boolean_mask/strided_slice_1/stack_2"
  op: "Const"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "report_uninitialized_variables/boolean_mask/strided_slice_1/stack_1"
  op: "Const"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "report_uninitialized_variables/boolean_mask/strided_slice_1/stack"
  op: "Const"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "report_uninitialized_variables/boolean_mask/Shape_1"
  op: "Const"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "report_uninitialized_variables/boolean_mask/strided_slice_1"
  op: "StridedSlice"
  input: "report_uninitialized_variables/boolean_mask/Shape_1"
  input: "report_uninitialized_variables/boolean_mask/strided_slice_1/stack"
  input: "report_uninitialized_variables/boolean_mask/strided_slice_1/stack_1"
  input: "report_uninitialized_variables/boolean_mask/strided_slice_1/stack_2"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "report_uninitialized_variables/boolean_mask/Prod/reduction_indices"
  op: "Const"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "report_uninitialized_variables/boolean_mask/strided_slice/stack_2"
  op: "Const"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "report_uninitialized_variables/boolean_mask/strided_slice/stack_1"
  op: "Const"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "report_uninitialized_variables/boolean_mask/strided_slice/stack"
  op: "Const"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "report_uninitialized_variables/boolean_mask/Shape"
  op: "Const"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "report_uninitialized_variables/boolean_mask/strided_slice"
  op: "StridedSlice"
  input: "report_uninitialized_variables/boolean_mask/Shape"
  input: "report_uninitialized_variables/boolean_mask/strided_slice/stack"
  input: "report_uninitialized_variables/boolean_mask/strided_slice/stack_1"
  input: "report_uninitialized_variables/boolean_mask/strided_slice/stack_2"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "report_uninitialized_variables/boolean_mask/Prod"
  op: "Prod"
  input: "report_uninitialized_variables/boolean_mask/strided_slice"
  input: "report_uninitialized_variables/boolean_mask/Prod/reduction_indices"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "report_uninitialized_variables/boolean_mask/concat/values_0"
  op: "Pack"
  input: "report_uninitialized_variables/boolean_mask/Prod"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "report_uninitialized_variables/boolean_mask/concat"
  op: "ConcatV2"
  input: "report_uninitialized_variables/boolean_mask/concat/values_0"
  input: "report_uninitialized_variables/boolean_mask/strided_slice_1"
  input: "report_uninitialized_variables/boolean_mask/concat/axis"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "report_uninitialized_variables/Const"
  op: "Const"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 3
          }
        }
        string_val: "global_step"
        string_val: "weight"
        string_val: "biase"
      }
    }
  }
}
node {
  name: "report_uninitialized_variables/boolean_mask/Reshape"
  op: "Reshape"
  input: "report_uninitialized_variables/Const"
  input: "report_uninitialized_variables/boolean_mask/concat"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "biase"
  op: "VariableV2"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@biase"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "report_uninitialized_variables/IsVariableInitialized_2"
  op: "IsVariableInitialized"
  input: "biase"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@biase"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "weight"
  op: "VariableV2"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weight"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "report_uninitialized_variables/IsVariableInitialized_1"
  op: "IsVariableInitialized"
  input: "weight"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weight"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "report_uninitialized_variables/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "report_uninitialized_variables/stack"
  op: "Pack"
  input: "report_uninitialized_variables/IsVariableInitialized"
  input: "report_uninitialized_variables/IsVariableInitialized_1"
  input: "report_uninitialized_variables/IsVariableInitialized_2"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "report_uninitialized_variables/LogicalNot"
  op: "LogicalNot"
  input: "report_uninitialized_variables/stack"
  device: "/job:ps/replica:0/task:0/cpu:0"
}
node {
  name: "report_uninitialized_variables/boolean_mask/Reshape_1"
  op: "Reshape"
  input: "report_uninitialized_variables/LogicalNot"
  input: "report_uninitialized_variables/boolean_mask/Reshape_1/shape"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "report_uninitialized_variables/boolean_mask/Where"
  op: "Where"
  input: "report_uninitialized_variables/boolean_mask/Reshape_1"
  device: "/job:ps/replica:0/task:0/cpu:0"
}
node {
  name: "report_uninitialized_variables/boolean_mask/Squeeze"
  op: "Squeeze"
  input: "report_uninitialized_variables/boolean_mask/Where"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 1
      }
    }
  }
}
node {
  name: "report_uninitialized_variables/boolean_mask/Gather"
  op: "Gather"
  input: "report_uninitialized_variables/boolean_mask/Reshape"
  input: "report_uninitialized_variables/boolean_mask/Squeeze"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "Tindices"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "Tparams"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "validate_indices"
    value {
      b: true
    }
  }
}
node {
  name: "report_uninitialized_variables/boolean_mask/Gather_S2"
  op: "_Send"
  input: "report_uninitialized_variables/boolean_mask/Gather"
  device: "/job:ps/replica:0/task:0/cpu:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "client_terminated"
    value {
      b: false
    }
  }
  attr {
    key: "recv_device"
    value {
      s: "/job:worker/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device"
    value {
      s: "/job:ps/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device_incarnation"
    value {
      i: -4670719944347064416
    }
  }
  attr {
    key: "tensor_name"
    value {
      s: "edge_48_report_uninitialized_variables/boolean_mask/Gather"
    }
  }
}
library {
}
versions {
  producer: 22
}

2017-06-01 08:54:38.477311: I tensorflow/core/distributed_runtime/master_session.cc:505] RunPartitions step_id 102823890515099801 execution_count 0
2017-06-01 08:54:38.477359: I tensorflow/core/framework/log_memory.cc:35] __LOG_MEMORY__ MemoryLogStep { step_id: 4 handle: "0000000000000003" }
2017-06-01 08:54:38.477412: I tensorflow/core/common_runtime/executor.cc:1556] Process node: 0 step 4 _SOURCE = NoOp[]() is dead: 0
